{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "kernel_regularizer": null, "padding": "valid", "dtype": "float32", "use_bias": true, "name": "conv2d_1", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "padding": "valid", "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "units": 128, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "units": 10, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}}}], "keras_version": "2.0.4", "backend": "tensorflow"}